/***********************************************************************************************************************
Skeleton_Detection
文件名:        app_handler.c
描述   :       一级界面的时间和电量更新

版本   :       V1.0
修改   :   
完成日期： 
************************************************************************************************************************/

/***********************************************************************************************************************
 * INCLUDES
 */
#include "app_handler.h"
#include "key.h"
#include "led.h"
#include "ui.h"
#include "app_task.h"
#include "oled.h"
#include "battery.h"
#include "delay.h"
#include "log.h"
/***********************************************************************************************************************
 * CONSTANTS
 */

/***********************************************************************************************************************
 * TYPEDEFS
 */

/***********************************************************************************************************************
 * LOCAL VARIABLES
 */
 TimerHandle_t 	app_time_show_handle;			//周期定时器句柄

/***********************************************************************************************************************
 * LOCAL FUNCTIONS  DECLARE
 */
void App_timeShowHandler(TimerHandle_t xTimer); 	//周期定时器回调函数


/***********************************************************************************************************************
 * LOCAL FUNCTIONS  
 */

/***********************************************************************************************************************
 * PUBLIC FUNCTIONS
 */

/**********************************************************************************************************
* 函数名：        App_keyHandler
* 功能描述：      按键处理
* 参数说明：      none
* 返回值说明：    none
* 修改记录： 
**********************************************************************************************************/
void App_Time_Show_Init(void)
{
	app_time_show_handle = xTimerCreate((const char*		)"AppTimeShowTimer",
								(TickType_t			)100000*60,
								(UBaseType_t		)pdTRUE,
								(void*				)1,
								(TimerCallbackFunction_t)App_timeShowHandler); //周期定时器，周期一分钟(1000个时钟节拍)，周期模式
	xTimerStart(app_time_show_handle,0);
}

void App_Time_Show_Start(void){
	xTimerStart(app_time_show_handle,0);
}
void App_Time_Show_Stop(void){
	xTimerStop(app_time_show_handle,0);
}

/*********************************************************************************************************
* 函数名：    App_timeShowHandler
* 功能描述：  更新时间用
* 作者：      Momo  
* 参数说明：  
* 返回值说明：
* 修改记录：由于按键较硬，按下抬起一般要2-4 * 10个节拍，大多数是3 * 10个节拍
	长按一般是 10-15 * 10个节拍，所以LONG_PRESS_TIME 设置位10
	当只检测到一次是，定义为误触
**********************************************************************************************************/

void App_timeShowHandler(TimerHandle_t xTimer)
{
	xEventGroupSetBits(app_event,APP_TIME_SHOW_EVENT);//触发app按键事件
}

/***********************************************************************************************************************
***********************************************************************************************************************/
